rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32K37_DCM.h
#define DCM_DCMSRR_DCMESF13_MASK                 (0x8000000U)
#define DCM_DCMSRR_DCMESF13_SHIFT                (27U)
#define DCM_DCMSRR_DCMESF13_WIDTH                (1U)
#define DCM_DCMSRR_DCMESF13(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF13_SHIFT)) & DCM_DCMSRR_DCMESF13_MASK)

#define DCM_DCMSRR_DCMESD13_MASK                 (0x10000000U)
#define DCM_DCMSRR_DCMESD13_SHIFT                (28U)
#define DCM_DCMSRR_DCMESD13_WIDTH                (1U)
#define DCM_DCMSRR_DCMESD13(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD13_SHIFT)) & DCM_DCMSRR_DCMESD13_MASK)

#define DCM_DCMSRR_DCMDCFT13_MASK                (0x20000000U)
#define DCM_DCMSRR_DCMDCFT13_SHIFT               (29U)
#define DCM_DCMSRR_DCMDCFT13_WIDTH               (1U)
#define DCM_DCMSRR_DCMDCFT13(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT13_SHIFT)) & DCM_DCMSRR_DCMDCFT13_MASK)

#define DCM_DCMSRR_DCMDCFE14_MASK                (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE14_SHIFT               (0U)
#define DCM_DCMSRR_DCMDCFE14_WIDTH               (21U)
#define DCM_DCMSRR_DCMDCFE14(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE14_SHIFT)) & DCM_DCMSRR_DCMDCFE14_MASK)

#define DCM_DCMSRR_DCMDCFF14_MASK                (0x7000000U)
#define DCM_DCMSRR_DCMDCFF14_SHIFT               (24U)
#define DCM_DCMSRR_DCMDCFF14_WIDTH               (3U)
#define DCM_DCMSRR_DCMDCFF14(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF14_SHIFT)) & DCM_DCMSRR_DCMDCFF14_MASK)

#define DCM_DCMSRR_DCMESF14_MASK                 (0x8000000U)
#define DCM_DCMSRR_DCMESF14_SHIFT                (27U)
#define DCM_DCMSRR_DCMESF14_WIDTH                (1U)
#define DCM_DCMSRR_DCMESF14(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF14_SHIFT)) & DCM_DCMSRR_DCMESF14_MASK)

#define DCM_DCMSRR_DCMESD14_MASK                 (0x10000000U)
#define DCM_DCMSRR_DCMESD14_SHIFT                (28U)
#define DCM_DCMSRR_DCMESD14_WIDTH                (1U)
#define DCM_DCMSRR_DCMESD14(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD14_SHIFT)) & DCM_DCMSRR_DCMESD14_MASK)

#define DCM_DCMSRR_DCMDCFT14_MASK                (0x20000000U)
#define DCM_DCMSRR_DCMDCFT14_SHIFT               (29U)
#define DCM_DCMSRR_DCMDCFT14_WIDTH               (1U)
#define DCM_DCMSRR_DCMDCFT14(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT14_SHIFT)) & DCM_DCMSRR_DCMDCFT14_MASK)

#define DCM_DCMSRR_DCMDCFE15_MASK                (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE15_SHIFT               (0U)
#define DCM_DCMSRR_DCMDCFE15_WIDTH               (21U)
#define DCM_DCMSRR_DCMDCFE15(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE15_SHIFT)) & DCM_DCMSRR_DCMDCFE15_MASK)

#define DCM_DCMSRR_DCMDCFF15_MASK                (0x7000000U)
#define DCM_DCMSRR_DCMDCFF15_SHIFT               (24U)
#define DCM_DCMSRR_DCMDCFF15_WIDTH               (3U)
#define DCM_DCMSRR_DCMDCFF15(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF15_SHIFT)) & DCM_DCMSRR_DCMDCFF15_MASK)

#define DCM_DCMSRR_DCMESF15_MASK                 (0x8000000U)
#define DCM_DCMSRR_DCMESF15_SHIFT                (27U)
#define DCM_DCMSRR_DCMESF15_WIDTH                (1U)
#define DCM_DCMSRR_DCMESF15(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF15_SHIFT)) & DCM_DCMSRR_DCMESF15_MASK)

#define DCM_DCMSRR_DCMESD15_MASK                 (0x10000000U)
#define DCM_DCMSRR_DCMESD15_SHIFT                (28U)
#define DCM_DCMSRR_DCMESD15_WIDTH                (1U)
#define DCM_DCMSRR_DCMESD15(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD15_SHIFT)) & DCM_DCMSRR_DCMESD15_MASK)

#define DCM_DCMSRR_DCMDCFT15_MASK                (0x20000000U)
#define DCM_DCMSRR_DCMDCFT15_SHIFT               (29U)
#define DCM_DCMSRR_DCMDCFT15_WIDTH               (1U)
#define DCM_DCMSRR_DCMDCFT15(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT15_SHIFT)) & DCM_DCMSRR_DCMDCFT15_MASK)

#define DCM_DCMSRR_DCMDCFE16_MASK                (0x1FFFFFU)
#define DCM_DCMSRR_DCMDCFE16_SHIFT               (0U)
#define DCM_DCMSRR_DCMDCFE16_WIDTH               (21U)
#define DCM_DCMSRR_DCMDCFE16(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFE16_SHIFT)) & DCM_DCMSRR_DCMDCFE16_MASK)

#define DCM_DCMSRR_DCMDCFF16_MASK                (0x7000000U)
#define DCM_DCMSRR_DCMDCFF16_SHIFT               (24U)
#define DCM_DCMSRR_DCMDCFF16_WIDTH               (3U)
#define DCM_DCMSRR_DCMDCFF16(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFF16_SHIFT)) & DCM_DCMSRR_DCMDCFF16_MASK)

#define DCM_DCMSRR_DCMESF16_MASK                 (0x8000000U)
#define DCM_DCMSRR_DCMESF16_SHIFT                (27U)
#define DCM_DCMSRR_DCMESF16_WIDTH                (1U)
#define DCM_DCMSRR_DCMESF16(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESF16_SHIFT)) & DCM_DCMSRR_DCMESF16_MASK)

#define DCM_DCMSRR_DCMESD16_MASK                 (0x10000000U)
#define DCM_DCMSRR_DCMESD16_SHIFT                (28U)
#define DCM_DCMSRR_DCMESD16_WIDTH                (1U)
#define DCM_DCMSRR_DCMESD16(x)                   (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMESD16_SHIFT)) & DCM_DCMSRR_DCMESD16_MASK)

#define DCM_DCMSRR_DCMDCFT16_MASK                (0x20000000U)
#define DCM_DCMSRR_DCMDCFT16_SHIFT               (29U)
#define DCM_DCMSRR_DCMDCFT16_WIDTH               (1U)
#define DCM_DCMSRR_DCMDCFT16(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMSRR_DCMDCFT16_SHIFT)) & DCM_DCMSRR_DCMDCFT16_MASK)
/*! @} */

/*! @name DCMLCS_2 - LC Scan Status 2 */
/*! @{ */

#define DCM_DCMLCS_2_DCMLCSS6_MASK               (0x1U)
#define DCM_DCMLCS_2_DCMLCSS6_SHIFT              (0U)
#define DCM_DCMLCS_2_DCMLCSS6_WIDTH              (1U)
#define DCM_DCMLCS_2_DCMLCSS6(x)                 (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_2_DCMLCSS6_SHIFT)) & DCM_DCMLCS_2_DCMLCSS6_MASK)

#define DCM_DCMLCS_2_DCMLCC6_MASK                (0xEU)
#define DCM_DCMLCS_2_DCMLCC6_SHIFT               (1U)
#define DCM_DCMLCS_2_DCMLCC6_WIDTH               (3U)
#define DCM_DCMLCS_2_DCMLCC6(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_2_DCMLCC6_SHIFT)) & DCM_DCMLCS_2_DCMLCC6_MASK)

#define DCM_DCMLCS_2_DCMLCE6_MASK                (0x10U)
#define DCM_DCMLCS_2_DCMLCE6_SHIFT               (4U)
#define DCM_DCMLCS_2_DCMLCE6_WIDTH               (1U)
#define DCM_DCMLCS_2_DCMLCE6(x)                  (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_2_DCMLCE6_SHIFT)) & DCM_DCMLCS_2_DCMLCE6_MASK)

#define DCM_DCMLCS_2_DCMLCFE6_MASK               (0x20U)
#define DCM_DCMLCS_2_DCMLCFE6_SHIFT              (5U)
#define DCM_DCMLCS_2_DCMLCFE6_WIDTH              (1U)
#define DCM_DCMLCS_2_DCMLCFE6(x)                 (((uint32_t)(((uint32_t)(x)) << DCM_DCMLCS_2_DCMLCFE6_SHIFT)) & DCM_DCMLCS_2_DCMLCFE6_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group DCM_Register_Masks */

/*!
 * @}
 */ /* end of group DCM_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K37_DCM_H_) */
